todo.org
#+TITLE: Demeter To Do List (also Athena and Artemis)
#+AUTHOR: Bruce Ravel
#+EMAIL: bravel AT bnl DOT gov

* top priorities
** small things
  - [ ] Setting of Ba2Co9O14 (Chanapa Kongmark), also some problem with ZnFe2O4
  - [ ] Lepidocrocite issue (amam gets changed to cmcm)
  - [ ] Dispersive algorithm, include in Athena
  - [X] S02 display issue
  - [ ] clone data sets and path lists in Artemis
  - [X] Artemis history improvments

** big things
  - [X] fuzzy over sites
  - [ ] 5 and 6 legged paths
  - [ ] PCA improvements
  - [ ] feff8.5L
  - [ ] persistance of analysis methods in Athena

* larch chores

+ [X] finsh Athena templates, including recently added ones (e.g. MEE templates, pixel)
+ [ ] start work on Artemis-related templates
+ [ ] kaiser vs. kaiser-bessel
+ [ ] use of stddev array in LCF is slightly incorrect, needs to be sensitive to the sapce in which the merge was made.
+ [X] command line in command buffer in A&A

** Larch v. Ifeffit problem areas

   + Xray/Absorption/CL.pm -- this needs to be refactored
   + t/ tests need to be tested with Larch
   + in particular, need a t/001_larch.t test (with an appropriate SKIP in case of no server)
   + "nergy": XDAC vs. Ifeffit.  Larch will see "energy".
      * Perhaps a larch or ifeffit configuration attribute
      * ack-ing for '\bnergy\b' yields:
        : examples/recipes/MultiChannel/mc2prj
        : 54:  #my @energy    = $mc->get_array('nergy');
	:
        : lib/Demeter/Plugins/10BMMultiChannel.pm
	: 53:    my @energy = $mc->get_array('nergy');
	:
	: lib/Demeter/Plugins/X23A2MED.pm
	: 324:becomes "nergy".  Go figure.
	:
	: lib/Demeter/Plugins/x23a2med.demeter_conf
	: 10:default=nergy
   + Need to add Larch copyright statement throughout
        : ##             Larch is copyright (c) 2013 Matt Newville, Tom Trainer
        : ##                                 http://xraypy.github.io/xraylarch/


* perl modules to evaluate

 + Path:Tiny to replace File::Spec
 + Test::Class and Test::Class::Moose

* things that need doing
  
** Moose issues

** wx issues
  - [ ] why does Wx::FileDialog with ~wxFD_OVERWRITE_PROMPT~ style not work correctly?
        see https://bugzilla.gnome.org/show_bug.cgi?id=631908 and 
        https://bugs.launchpad.net/ubuntu/+source/gtk+2.0/+bug/558674 for more info
        Turns out this is a gtk problem -- I can make the same thing happen with Firefox!

** installation issues [2/2]
  - [X] Relocation needs testing on Windows, need to make sure that
        the executables can all be found,
  - [X] also need to be able to find all of Ifeffit CL and CAPS files.

** Demeter bugs, shortcomings, missing features  [5/20] [25%]
  - [ ] in =Demeter::Data::IO::save_many=, why doesn't updating in n specifying "background" not work to bring data up to date?  (fft, i.e. doing autobk, does work)
  - [ ] tie multiple groups together (e.g. MED data with reference)
  - [ ] add a record to an existing Athena project file
  - [ ] clnorm + Julia and Jingen's MBACK replacement
  - [ ] Data object should note that datatype is xanes and not compute fbkg since the bkg array does not exist
  - [ ] cannot specify title for stddev and variance plots
  - [ ] Demeter command backend needs lots of polishing
  - [ ] 3rd derivative
  - [ ] SDK: better documentation for freeze/thaw//serialize/deserialize
  - [ ] error check deserialization for all objects, verify that it is a yaml or whatnot, return 0 if not
  - [ ] OpenBabel interface, tied into Feff
  - [ ] MRU lists and unicode, unicode-y file paths fail the -e test at Demeter::MRU line 77
  - [ ] Feff8 integration
  - [ ] Use PDL in pathfinder
  - [X] Add tests to Path ranking framework (Karine Provost's idea, implemented in Demeter)
  - [ ] background groups for AXAFS
  - [X] serialize VPath, put VPath into dpj and fpj files
  - [X] set E0 to peak of white line
  - [X] need to disable indicators during the Rk plot.  Indicators (as implemented) are not consistent with multiplot
  - [X] Plucking from gnuplot really sucks



** Athena

*** needs testing [/]

*** Tools [22/25] [88%]
   1. [X] main
   2. [X] calibrate
   3. [X] align
   4. [X] deglitch
   5. [X] /smooth with Savitsky-Golay filter/ [[file:notes/sgolay.m][Matlab routine for SG filter]]; +smooth with boxcar average [[http://comments.gmane.org/gmane.comp.lang.perl.pdl.general/6333][See this]]+
   6. [X] truncate
   7. [X] rebin
   8. [X] convolution and noise
   9. [ ] /deconvolution/
   10. [X] self absorption
   11. [X] copy series
   12. [X] data summation

   13. [ ] dispersive
   14. [X] multi-electron removal

   15. [X] LCF
   16. [X] /PCA/ [[http://mailman.jach.hawaii.edu/pipermail/perldl/2006-August/000588.html][PCA from PDL mail archives]]
   17. [X] Peak fit
   18. [X] log ratio
   19. [X] difference

   20. [ ] explain FT
   21. [X] disk watcher
   22. [X] XDI
   23. [X] journal
   24. [X] plugins
   25. [X] preference 

