todo.html
<?xml version="1.0" encoding="iso-8859-1"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Demeter To Do List (also Athena and Artemis)</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1"/>
<meta name="title" content="Demeter To Do List (also Athena and Artemis)"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2014-01-24T16:07-0500"/>
<meta name="author" content="Bruce Ravel"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>

</head>
<body>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">Demeter To Do List (also Athena and Artemis)</h1>


<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 top priorities</a>
<ul>
<li><a href="#sec-1-1">1.1 small things</a></li>
<li><a href="#sec-1-2">1.2 big things</a></li>
</ul>
</li>
<li><a href="#sec-2">2 larch chores</a>
<ul>
<li><a href="#sec-2-1">2.1 Larch v. Ifeffit problem areas</a></li>
</ul>
</li>
<li><a href="#sec-3">3 perl modules to evaluate</a></li>
<li><a href="#sec-4">4 things that need doing</a>
<ul>
<li><a href="#sec-4-1">4.1 Moose issues</a></li>
<li><a href="#sec-4-2">4.2 wx issues</a></li>
<li><a href="#sec-4-3">4.3 installation issues [2/2]</a></li>
<li><a href="#sec-4-4">4.4 Demeter bugs, shortcomings, missing features  [5/20] [25%]</a></li>
<li><a href="#sec-4-5">4.5 Athena</a></li>
<li><a href="#sec-4-6">4.6 raw data and plugins</a></li>
<li><a href="#sec-4-7">4.7 Windows issues [4/9] [44%]</a></li>
<li><a href="#sec-4-8">4.8 Artemis</a></li>
<li><a href="#sec-4-9">4.9 Hephaestus</a></li>
<li><a href="#sec-4-10">4.10 Other object types [0/3]</a></li>
</ul>
</li>
<li><a href="#sec-5">5 Atoms and Feff</a>
<ul>
<li><a href="#sec-5-1">5.1 CIF [0/3] [0%]</a></li>
<li><a href="#sec-5-2">5.2 Atoms [3/9] [33%]</a></li>
<li><a href="#sec-5-3">5.3 Feff</a></li>
</ul>
</li>
<li><a href="#sec-6">6 Ifeffit</a></li>
<li><a href="#sec-7">7 Weird stuff I'd prefer not to implement unless demanded</a></li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> top priorities</h2>
<div class="outline-text-2" id="text-1">


</div>

<div id="outline-container-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> small things</h3>
<div class="outline-text-3" id="text-1-1">

<ul>
<li><code>[&nbsp;]</code> Setting of Ba2Co9O14 (Chanapa Kongmark), also some problem with ZnFe2O4
</li>
<li><code>[&nbsp;]</code> Lepidocrocite issue (amam gets changed to cmcm)
</li>
<li><code>[&nbsp;]</code> Dispersive algorithm, include in Athena
</li>
<li><code>[X]</code> S02 display issue
</li>
<li><code>[&nbsp;]</code> clone data sets and path lists in Artemis
</li>
<li><code>[X]</code> Artemis history improvments
</li>
</ul>


</div>

</div>

<div id="outline-container-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> big things</h3>
<div class="outline-text-3" id="text-1-2">

<ul>
<li><code>[X]</code> fuzzy over sites
</li>
<li><code>[&nbsp;]</code> 5 and 6 legged paths
</li>
<li><code>[&nbsp;]</code> PCA improvements
</li>
<li><code>[&nbsp;]</code> feff8.5L
</li>
<li><code>[&nbsp;]</code> persistance of analysis methods in Athena
</li>
</ul>


</div>
</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> larch chores</h2>
<div class="outline-text-2" id="text-2">


<ul>
<li><code>[X]</code> finsh Athena templates, including recently added ones (e.g. MEE templates, pixel)
</li>
<li><code>[&nbsp;]</code> start work on Artemis-related templates
</li>
<li><code>[&nbsp;]</code> kaiser vs. kaiser-bessel
</li>
<li><code>[&nbsp;]</code> use of stddev array in LCF is slightly incorrect, needs to be sensitive to the sapce in which the merge was made.
</li>
<li><code>[X]</code> command line in command buffer in A&amp;A
</li>
</ul>



</div>

<div id="outline-container-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> Larch v. Ifeffit problem areas</h3>
<div class="outline-text-3" id="text-2-1">


<ul>
<li>Xray/Absorption/CL.pm &ndash; this needs to be refactored
</li>
<li>t/ tests need to be tested with Larch
</li>
<li>in particular, need a t/001<sub>larch</sub>.t test (with an appropriate SKIP in case of no server)
</li>
<li>"nergy": XDAC vs. Ifeffit.  Larch will see "energy".
<ul>
<li>Perhaps a larch or ifeffit configuration attribute
</li>
<li>ack-ing for '\bnergy\b' yields:
<pre class="example">
examples/recipes/MultiChannel/mc2prj
54:  #my @energy    = $mc-&gt;get_array('nergy');

lib/Demeter/Plugins/10BMMultiChannel.pm
53:    my @energy = $mc-&gt;get_array('nergy');

lib/Demeter/Plugins/X23A2MED.pm
324:becomes "nergy".  Go figure.

lib/Demeter/Plugins/x23a2med.demeter_conf
10:default=nergy
</pre>

</li>
</ul>

</li>
<li>Need to add Larch copyright statement throughout
<pre class="example">
##             Larch is copyright (c) 2013 Matt Newville, Tom Trainer
##                                 http://xraypy.github.io/xraylarch/
</pre>

</li>
</ul>



</div>
</div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> perl modules to evaluate</h2>
<div class="outline-text-2" id="text-3">


<ul>
<li>Path:Tiny to replace <a href="#File-Spec">File::Spec</a>
</li>
<li>Test::Class and Test::Class::Moose
</li>
</ul>


</div>

</div>

<div id="outline-container-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> things that need doing</h2>
<div class="outline-text-2" id="text-4">



</div>

<div id="outline-container-4-1" class="outline-3">
<h3 id="sec-4-1"><span class="section-number-3">4.1</span> Moose issues</h3>
<div class="outline-text-3" id="text-4-1">


</div>

</div>

<div id="outline-container-4-2" class="outline-3">
<h3 id="sec-4-2"><span class="section-number-3">4.2</span> wx issues</h3>
<div class="outline-text-3" id="text-4-2">

<ul>
<li><code>[&nbsp;]</code> why does Wx::FileDialog with <code>wxFD_OVERWRITE_PROMPT</code> style not work correctly?
        see <a href="https://bugzilla.gnome.org/show_bug.cgi?id=631908">https://bugzilla.gnome.org/show_bug.cgi?id=631908</a> and 
        <a href="https://bugs.launchpad.net/ubuntu/+source/gtk+2.0/+bug/558674">https://bugs.launchpad.net/ubuntu/+source/gtk+2.0/+bug/558674</a> for more info
        Turns out this is a gtk problem &ndash; I can make the same thing happen with Firefox!
</li>
</ul>


</div>

</div>

<div id="outline-container-4-3" class="outline-3">
<h3 id="sec-4-3"><span class="section-number-3">4.3</span> installation issues [2/2]</h3>
<div class="outline-text-3" id="text-4-3">

<ul>
<li><code>[X]</code> Relocation needs testing on Windows, need to make sure that
        the executables can all be found,
</li>
<li><code>[X]</code> also need to be able to find all of Ifeffit CL and CAPS files.
</li>
</ul>


</div>

</div>

<div id="outline-container-4-4" class="outline-3">
<h3 id="sec-4-4"><span class="section-number-3">4.4</span> Demeter bugs, shortcomings, missing features  [5/20] [25%]</h3>
<div class="outline-text-3" id="text-4-4">

<ul>
<li><code>[&nbsp;]</code> in <code>Demeter::Data::IO::save_many</code>, why doesn't updating in n specifying "background" not work to bring data up to date?  (fft, i.e. doing autobk, does work)
</li>
<li><code>[&nbsp;]</code> tie multiple groups together (e.g. MED data with reference)
</li>
<li><code>[&nbsp;]</code> add a record to an existing Athena project file
</li>
<li><code>[&nbsp;]</code> clnorm + Julia and Jingen's MBACK replacement
</li>
<li><code>[&nbsp;]</code> Data object should note that datatype is xanes and not compute fbkg since the bkg array does not exist
</li>
<li><code>[&nbsp;]</code> cannot specify title for stddev and variance plots
</li>
<li><code>[&nbsp;]</code> Demeter command backend needs lots of polishing
</li>
<li><code>[&nbsp;]</code> 3rd derivative
</li>
<li><code>[&nbsp;]</code> SDK: better documentation for freeze/thaw//serialize/deserialize
</li>
<li><code>[&nbsp;]</code> error check deserialization for all objects, verify that it is a yaml or whatnot, return 0 if not
</li>
<li><code>[&nbsp;]</code> OpenBabel interface, tied into Feff
</li>
<li><code>[&nbsp;]</code> MRU lists and unicode, unicode-y file paths fail the -e test at Demeter::MRU line 77
</li>
<li><code>[&nbsp;]</code> Feff8 integration
</li>
<li><code>[&nbsp;]</code> Use PDL in pathfinder
</li>
<li><code>[X]</code> Add tests to Path ranking framework (Karine Provost's idea, implemented in Demeter)
</li>
<li><code>[&nbsp;]</code> background groups for AXAFS
</li>
<li><code>[X]</code> serialize VPath, put VPath into dpj and fpj files
</li>
<li><code>[X]</code> set E0 to peak of white line
</li>
<li><code>[X]</code> need to disable indicators during the Rk plot.  Indicators (as implemented) are not consistent with multiplot
</li>
<li><code>[X]</code> Plucking from gnuplot really sucks
</li>
</ul>




</div>

</div>

<div id="outline-container-4-5" class="outline-3">
<h3 id="sec-4-5"><span class="section-number-3">4.5</span> Athena</h3>
<div class="outline-text-3" id="text-4-5">


<ul>
<li id="sec-4-5-1">needs testing [/]<br/>

</li>
</ul>
<ul>
<li id="sec-4-5-2">Tools [22/25] [88%]<br/>
<ol>
<li><code>[X]</code> main
</li>
<li><code>[X]</code> calibrate
</li>
<li><code>[X]</code> align
</li>
<li><code>[X]</code> deglitch
</li>
<li><code>[X]</code> <i>smooth with Savitsky-Golay filter</i> <a href="notes/sgolay.m">Matlab routine for SG filter</a>; +smooth with boxcar average <a href="http://comments.gmane.org/gmane.comp.lang.perl.pdl.general/6333">See this</a>+
</li>
<li><code>[X]</code> truncate
</li>
<li><code>[X]</code> rebin
</li>
<li><code>[X]</code> convolution and noise
</li>
<li><code>[&nbsp;]</code> <i>deconvolution</i>
</li>
<li><code>[X]</code> self absorption
</li>
<li><code>[X]</code> copy series
</li>
<li><code>[X]</code> data summation

</li>
<li><code>[&nbsp;]</code> dispersive
</li>
<li><code>[X]</code> multi-electron removal

</li>
<li><code>[X]</code> LCF
</li>
<li><code>[X]</code> <i>PCA</i> <a href="http://mailman.jach.hawaii.edu/pipermail/perldl/2006-August/000588.html">PCA from PDL mail archives</a>
</li>
<li><code>[X]</code> Peak fit
</li>
<li><code>[X]</code> log ratio
</li>
<li><code>[X]</code> difference

</li>
<li><code>[&nbsp;]</code> explain FT
</li>
<li><code>[X]</code> disk watcher
</li>
<li><code>[X]</code> XDI
</li>
<li><code>[X]</code> journal
</li>
<li><code>[X]</code> plugins
</li>
<li><code>[X]</code> preference 
</li>
</ol>


<ul>
<li id="sec-4-5-2-1">Requires PDL<br/>
<ol>
