todo.org
**** Requires PDL
    1. smoothing by S-G (done with Larch)
    2. deconvolution
    3. +PCA+
    4. +boxcar average+

*** needs doing [3/15] [20%]
   - [ ] beter error handling in plugins -- specifically need to do a
         better job of trapping errors in the ~fix~ method.  Perhaps
         ~fix~ should always be called within an ~eval~?
   - [X] report to a text dialog on values of a particular parameter for all/marked groups
   - [ ] implement megamerge in Athena
   - [X] links to documentation on each tool
   - [X] *Main window* [3/3] [100%]
     + [X] +SpinCtrl for use with Rbkg+, event handler triggered twice on first use (found work-around)
     + [X] +SpinCtrl for use with bkg_spl1/2 (I find this to be a much worse idea)+ (not implemented)
     + [X] push bkg_e0 /algorithm/ onto marked/all groups and recalculate
   - [ ] *Convolve/noise tool*
     + add noise to chi data
   - [ ] *Difference tool* [0/1]
     + [ ] difference in k
   - [ ] *LCF tool* [0/4]
     + [ ] persistance of LCF results
     + [ ] satisfying both inclusive and unity can be trouble for
           poorly normalized data and/or poor standard selection
           (see email from Jack Hitch)
     + [ ] compute R-factor in k or R using fit from energy.  (see
           mail from Scott 7 January 2012)
     + [ ] boundary on E0 shift.  See email from Dean Hesterburg from 30 May, 2014
   - [-] *PCA tool* [2/10]
     + [ ] persistance
     + [ ] manual entry of component coefficients (??)
     + [ ] cluster analysis, select two components and plot the
           associations of each data with those two in a scatter plot.
     + [ ] worry about "def group.tt" line being too long in tt template
     + [ ] plotting in pgplot
     + [ ] error analysis, RET, SPOIL, etc, determination of number
           of components, validity of TT, etc
     + [ ] specialized file headers for reconstruction and tt save files
     + [ ] pluck buttons for analysis range don't work
     + [X] save eigenvectors to a file
     + [X] if the marked groups are changed after performing the PCA
           but before reconstructing data, the plot will fail with
           and exception.  need to save the list of data that went
           into the PCA and check against that rather than the
           current list of marked groups
   - [-] *Peakfit tool* [7/12]
     + [ ] persistance
     + [ ] verify that fit is sensible (ndata/ninfo vs nparam)
     + [ ] broken using XES
     + [ ] explicitly state ninfo and epsilon
     + [ ] for Larch, bounds on parameters
     + [X] implement pseudovoight
     + [X] verify that all centroids are within (or near) fit range
     + [X] behavior when changing data
     + [X] pluck fit ranges
     + [X] +ndata is full data range rather than fit range with Fityk backend+ (igoring this)
     + [X] +explicitly set title of plot+ (i can live with this)
     + [X] sequence over marked groups
   - [ ] *Data watcher*
   - [-] *MEE tool* [1/3]
     + [X] arctan removal
     + [ ] other algorithms from the literature
     + [ ] good guesses for parameters
   - [ ] *Plot menu*
     + zoom/unzoom/cursor for pgplot
   - [ ] *metadata tool*
   - [ ] *Data summer*
     + push_values method needs to update menus to reflect changes in group list

** raw data and plugins
   - Need to expand the filetype system by examining data from *all* the XAS beamlines in the world.  Yes ... all of them.
   - solicit help from the facility representatives

** Windows issues [4/9] [44%]
  - [X] parameter group context menus don't get posted (see
	http://www.nntp.perl.org/group/perl.wxperl.users/2011/03/msg7929.html)
  - [ ] the frickin' Gnuplot error logs seem to remain open and locked
	on Windows when a crash happens
  - [ ] status bar does not get color for wait or error messages
	/this may be unfixable, see/
	http://www.nntp.perl.org/group/perl.wxperl.users/2011/04/msg7943.html
  - [ ] The atoms panel background color is too light.  Which window
	needs its BackgroundColour set to wxNullColour?
  - [ ] clampbox does not get enabled/disabled explicitly, is this
	another aspect of StaticBox that is different on Windows? (see
	link above)
  - [ ] Need to test that paths with (parens|commas|quotes) get
	followed correctly in all situations
  - [X] Initial initialization of gnuplot and feff executable
        locations in the situation where the package has been moved or
        reinstalled such that and old demeter.ini still exists
  - [X] relocation of Strawberry leaves Ifeffit unable to find phase
	shift and CL tables (use an ENV variable?)
  - [X] The Strawberry+Demeter package does not coexist at all with
        ActivePerl.  Best solution is to generate ppd for Demeter
        armed with all dependencies.  Would need to compile wrapper
        and somehow get gnuplot on the machine. *Solved by explicitly
        calling Strawberry in the .bat files*


** Artemis
*** Artemis bugs and missing features [0/8]  [0%]
   - [ ] More work on history, see Anthony Ardizzi's issue
   - [ ] Reorganize lists, move individual items up and down, move
	 blocks up and down, Path list, +Plot list+
   - [ ] do SSPaths get serialized and deserialized with the pointers
         to the feff calculation set correctly and no additional
         folders being created in stash (as was the case for FSPath)?
   - [ ] implementing derivative of phase plotting would require
         proper handling of this signal in the bkg, residual, and
         running R-factor plots.  Also probably want to disallow it
         for R123 plots.
   - [ ] better way of moving an empirical standard from Athena to
         Artemis -- should be able to import it directly from the
         athena project file.
   - [ ] Display of S02 glyph on some Windows is broken, breaking S02 context menu
   - [ ] Eric says: "if u use the automatic choice of parameters for
         the paths, in combination with a few quick first shell models
         and an imported feff.inp the whole thing runs in trouble. I
         don't really expect name collisions, but it seems to loose
         track between all the feff runs."  /This is a bit unclear.../
   - [ ] Path drag and drop [0/3]
        - [ ] DND of an SSPath does not work correctly
        - [ ] DND of FPath also broken
        - [ ] DND of selection (currently only one at a time)

**** Project [2/4]
   - [X] VPaths to/from project file
   - [X] SSPaths not saved/restored properly?
   - [ ] Indicators to/from project file
   - [ ] GDS objects get created with same groupname over and over as
	 they are used in fits in the history

**** Advanced fitting
***** MFC [0/1]
   - [ ] Balance interstitial energies for MFC fits
