todo.html
<li>smoothing by S-G (done with Larch)
</li>
<li>deconvolution
</li>
<li><del>PCA</del>
</li>
<li><del>boxcar average</del>
</li>
</ol>


</li>
</ul>
</li>
</ul>
<ul>
<li id="sec-4-5-3">needs doing [3/14] [21%]<br/>
<ul>
<li><code>[&nbsp;]</code> beter error handling in plugins &ndash; specifically need to do a
         better job of trapping errors in the <code>fix</code> method.  Perhaps
         <code>fix</code> should always be called within an <code>eval</code>?
</li>
<li><code>[X]</code> report to a text dialog on values of a particular parameter for all/marked groups
</li>
<li><code>[&nbsp;]</code> implement megamerge in Athena
</li>
<li><code>[X]</code> links to documentation on each tool
</li>
<li><code>[X]</code> <b>Main window</b> [3/3] [100%]
<ul>
<li><code>[X]</code> <del>SpinCtrl for use with Rbkg</del>, event handler triggered twice on first use (found work-around)
</li>
<li><code>[X]</code> <del>SpinCtrl for use with bkg<sub>spl1</sub>/2 (I find this to be a much worse idea)</del> (not implemented)
</li>
<li><code>[X]</code> push bkg<sub>e0</sub> <i>algorithm</i> onto marked/all groups and recalculate
</li>
</ul>

</li>
<li><code>[&nbsp;]</code> <b>Convolve/noise tool</b>
<ul>
<li>add noise to chi data
</li>
</ul>

</li>
<li><code>[&nbsp;]</code> <b>Difference tool</b> [0/1]
<ul>
<li><code>[&nbsp;]</code> difference in k
</li>
</ul>

</li>
<li><code>[&nbsp;]</code> <b>LCF tool</b> [0/3]
<ul>
<li><code>[&nbsp;]</code> persistance of LCF results
</li>
<li><code>[&nbsp;]</code> satisfying both inclusive and unity can be trouble for
           poorly normalized data and/or poor standard selection
           (see email from Jack Hitch)
</li>
<li><code>[&nbsp;]</code> compute R-factor in k or R using fit from energy.  (see
           mail from Scott 7 January 2012)
</li>
</ul>

</li>
<li><code>[-]</code> <b>PCA tool</b> [2/10]
<ul>
<li><code>[&nbsp;]</code> persistance
</li>
<li><code>[&nbsp;]</code> manual entry of component coefficients (??)
</li>
<li><code>[&nbsp;]</code> cluster analysis, select two components and plot the
           associations of each data with those two in a scatter plot.
</li>
<li><code>[&nbsp;]</code> worry about "def group.tt" line being too long in tt template
</li>
<li><code>[&nbsp;]</code> plotting in pgplot
</li>
<li><code>[&nbsp;]</code> error analysis, RET, SPOIL, etc, determination of number
           of components, validity of TT, etc
</li>
<li><code>[&nbsp;]</code> specialized file headers for reconstruction and tt save files
</li>
<li><code>[&nbsp;]</code> pluck buttons for analysis range don't work
</li>
<li><code>[X]</code> save eigenvectors to a file
</li>
<li><code>[X]</code> if the marked groups are changed after performing the PCA
           but before reconstructing data, the plot will fail with
           and exception.  need to save the list of data that went
           into the PCA and check against that rather than the
           current list of marked groups
</li>
</ul>

</li>
<li><code>[-]</code> <b>Peakfit tool</b> [7/12]
<ul>
<li><code>[&nbsp;]</code> persistance
</li>
<li><code>[&nbsp;]</code> verify that fit is sensible (ndata/ninfo vs nparam)
</li>
<li><code>[&nbsp;]</code> broken using XES
</li>
<li><code>[&nbsp;]</code> explicitly state ninfo and epsilon
</li>
<li><code>[&nbsp;]</code> for Larch, bounds on parameters
</li>
<li><code>[X]</code> implement pseudovoight
</li>
<li><code>[X]</code> verify that all centroids are within (or near) fit range
</li>
<li><code>[X]</code> behavior when changing data
</li>
<li><code>[X]</code> pluck fit ranges
</li>
<li><code>[X]</code> <del>ndata is full data range rather than fit range with Fityk backend</del> (igoring this)
</li>
<li><code>[X]</code> <del>explicitly set title of plot</del> (i can live with this)
</li>
<li><code>[X]</code> sequence over marked groups
</li>
</ul>

</li>
<li><code>[&nbsp;]</code> <b>Data watcher</b>
</li>
<li><code>[-]</code> <b>MEE tool</b> [1/3]
<ul>
<li><code>[X]</code> arctan removal
</li>
<li><code>[&nbsp;]</code> other algorithms from the literature
</li>
<li><code>[&nbsp;]</code> good guesses for parameters
</li>
</ul>

</li>
<li><code>[&nbsp;]</code> <b>Plot menu</b>
<ul>
<li>zoom/unzoom/cursor for pgplot
</li>
</ul>

</li>
<li><code>[&nbsp;]</code> <b>metadata tool</b>
</li>
</ul>


</li>
</ul>
</div>

</div>

<div id="outline-container-4-6" class="outline-3">
<h3 id="sec-4-6"><span class="section-number-3">4.6</span> raw data and plugins</h3>
<div class="outline-text-3" id="text-4-6">

<ul>
<li>Need to expand the filetype system by examining data from <b>all</b> the XAS beamlines in the world.  Yes &hellip; all of them.
</li>
<li>solicit help from the facility representatives
</li>
</ul>


</div>

</div>

<div id="outline-container-4-7" class="outline-3">
<h3 id="sec-4-7"><span class="section-number-3">4.7</span> Windows issues [4/9] [44%]</h3>
<div class="outline-text-3" id="text-4-7">

<ul>
<li><code>[X]</code> parameter group context menus don't get posted (see
        <a href="http://www.nntp.perl.org/group/perl.wxperl.users/2011/03/msg7929.html">http://www.nntp.perl.org/group/perl.wxperl.users/2011/03/msg7929.html</a>)
</li>
<li><code>[&nbsp;]</code> the frickin' Gnuplot error logs seem to remain open and locked
        on Windows when a crash happens
</li>
<li><code>[&nbsp;]</code> status bar does not get color for wait or error messages
        <i>this may be unfixable, see</i>
        <a href="http://www.nntp.perl.org/group/perl.wxperl.users/2011/04/msg7943.html">http://www.nntp.perl.org/group/perl.wxperl.users/2011/04/msg7943.html</a>
</li>
<li><code>[&nbsp;]</code> The atoms panel background color is too light.  Which window
        needs its BackgroundColour set to wxNullColour?
</li>
<li><code>[&nbsp;]</code> clampbox does not get enabled/disabled explicitly, is this
        another aspect of StaticBox that is different on Windows? (see
        link above)
</li>
<li><code>[&nbsp;]</code> Need to test that paths with (parens|commas|quotes) get
        followed correctly in all situations
</li>
<li><code>[X]</code> Initial initialization of gnuplot and feff executable
        locations in the situation where the package has been moved or
        reinstalled such that and old demeter.ini still exists
</li>
<li><code>[X]</code> relocation of Strawberry leaves Ifeffit unable to find phase
        shift and CL tables (use an ENV variable?)
</li>
<li><code>[X]</code> The Strawberry+Demeter package does not coexist at all with
        ActivePerl.  Best solution is to generate ppd for Demeter
        armed with all dependencies.  Would need to compile wrapper
        and somehow get gnuplot on the machine. <b>Solved by explicitly         calling Strawberry in the .bat files</b>
</li>
</ul>



</div>

</div>

<div id="outline-container-4-8" class="outline-3">
<h3 id="sec-4-8"><span class="section-number-3">4.8</span> Artemis</h3>
<div class="outline-text-3" id="text-4-8">

<ul>
<li id="sec-4-8-1">Artemis bugs and missing features [0/8]  [0%]<br/>
<ul>
<li><code>[&nbsp;]</code> More work on history, see Anthony Ardizzi's issue
</li>
<li><code>[&nbsp;]</code> Reorganize lists, move individual items up and down, move
         blocks up and down, Path list, <del>Plot list</del>
</li>
<li><code>[&nbsp;]</code> do SSPaths get serialized and deserialized with the pointers
         to the feff calculation set correctly and no additional
         folders being created in stash (as was the case for FSPath)?
</li>
<li><code>[&nbsp;]</code> implementing derivative of phase plotting would require
         proper handling of this signal in the bkg, residual, and
         running R-factor plots.  Also probably want to disallow it
         for R123 plots.
</li>
<li><code>[&nbsp;]</code> better way of moving an empirical standard from Athena to
         Artemis &ndash; should be able to import it directly from the
         athena project file.
</li>
<li><code>[&nbsp;]</code> Display of S02 glyph on some Windows is broken, breaking S02 context menu
</li>
<li><code>[&nbsp;]</code> Eric says: "if u use the automatic choice of parameters for
         the paths, in combination with a few quick first shell models
         and an imported feff.inp the whole thing runs in trouble. I
         don't really expect name collisions, but it seems to loose
         track between all the feff runs."  <i>This is a bit unclear&hellip;</i>
</li>
<li><code>[&nbsp;]</code> Path drag and drop [0/3]
<ul>
<li><code>[&nbsp;]</code> DND of an SSPath does not work correctly
</li>
<li><code>[&nbsp;]</code> DND of FPath also broken
</li>
<li><code>[&nbsp;]</code> DND of selection (currently only one at a time)
</li>
</ul>

</li>
</ul>


<ul>
<li id="sec-4-8-1-1">Project [2/4]<br/>
<ul>
<li><code>[X]</code> VPaths to/from project file
</li>
<li><code>[X]</code> SSPaths not saved/restored properly?
</li>
<li><code>[&nbsp;]</code> Indicators to/from project file
</li>
<li><code>[&nbsp;]</code> GDS objects get created with same groupname over and over as
         they are used in fits in the history
</li>
</ul>


</li>
</ul>
<ul>
<li id="sec-4-8-1-2">Advanced fitting<br/>
<ul>
<li id="sec-4-8-1-2-1">MFC [0/1]<br/>
<ul>
<li><code>[&nbsp;]</code> Balance interstitial energies for MFC fits
</li>
</ul>

</li>
</ul>
<ul>
