todo.org
***** MDS & Fit Sequence [0/4]
   - [ ] Import mutiple data sets from an Athena project file
   - [ ] feffit.inp import: needs testing; MDS that is not merely MKW
   - [ ] Clone data sets such that the path list gets replicated efficiently (i.e. for MDS fits)
   - [ ] Clone all/marked paths between data sets


*** Histograms [12/14] [85%]
   - [X] Triangle object
     - yields a DS path and a TS path
     - by R and theta
     - +by a trio of Cartesian coordinates+
   - [ ] triangle histogram
   - [-] *Error checking* in Artemis, e.g. check that there is at least one bin in the supplied range(s)
	 - [X] SS
	 - [ ] ncl
	 - [ ] thru

** Hephaestus
  More standards!!

** Other object types [0/3]
  - [ ] Structural Units
      + Extension of VPath
      + Store GDS, feff, and path objects in a zip file.
      + On import, mark GDS parameters as merge if in conflict
  - [ ] MSPaths
      + Much like SSPath, make an arbitrary n-legged path
  - [ ] Nearly collinear paths, ThreeBody
      + Extension of VPath
      + need to worry about load order in Demeter.pm
      + Define a three body configuration, generate its 4-legged path and a sequence of three-legged paths along with a mixing parameter.
      + It will take a single set of path parameters that are pushed onto the generated Path objects, except for the amplitude, which will be computed from the mixing parameter.
      + This is a single object for the user to interact with which expands into 2 or 3 3-legged paths and a single 4-legged path
      
      
* Atoms and Feff


** CIF [0/3] [0%]
  - [ ] CIF issue: CIF file with "_eof" token at end of file, as in [[file:notes/H16PW12O46.cif][this cif file]]
  - [ ] Handle CIF import problems more gracefully (See Shelly's other email from 17 June 2011)
  - [ ] CIF errors are not handled gracefully (e.g. multiple occupancy)

** Atoms [3/9] [33%]
  - [ ] Setting of Ba2Co9O14 (Chanapa Kongmark), also some problem with ZnFe2O4
  - [ ] Lepidocrocite issue (amam gets changed to cmcm)
  - [ ] 2 sites at the same position with occupancies <1.  see file above for an example
  - [ ] George Sterbinsky's recent mailing list post that turned out to be about 
	atoms' sphere and rhomboid in a non-orthogonal group
  - [ ] very confusing error message when core is not a tag
  - [ ] Why does Amam in lepidocrocite get changed to Cmcm ?
  - [X] Shell tags in the feff.inp ATOMS list
  - [X] Rhombic groups seem not be handled properly.  This example fails to generate a subshell of 3 atoms at ~1.9A
         : title name:     Fe2O3  hematite
         : space  R -3 c
         : a    = 5.0380	b    = 5.0380	c    = 13.7720
         : rmax = 6.00	core = Fe1
         : atom
         :   Fe     0.00000   0.00000   0.35530  Fe1
         :   O      0.30590   0.00000   0.25000  O1
  - [X] This input data fails
         : title formula:  LaCoO3
         : title refer1:  PRB V. 66 P. 094408 (2002)
         : title notes:   T = 300 K
         : space  r -3 c
         : a = 5.44864       c = 13.1035
         : rmax = 6.00       core = Co1
         : atom
         :   Co     0.00000   0.00000   0.00000  Co1
         :   La     0.00000   0.00000   0.25000  La1
         :   O      0.55032   0.00000   0.25000  O1


** Feff

*** Feff8 is unsupported except as an Atoms output type

https://github.com/xraypy/feff85exafs

*** Polarization and ellipticity

*** Five and six legged paths
 1. [[file:examples/h12213.cif][This CIF file]] is an example of a structure that has five and six
    legged nearly collinear scattering paths at around 4 Angstroms.  It
    has metal atoms bridged by cyanide (CN), like Prussian Blue (see for
    instance [[http://dx.doi.org/10.1021/ic50177a008]])

 2. Another example: 1-4 dibromo benzene has Br scatterers across a
    benzene ring which can be seen at about 6 Angstroms, along with
    3s, 4s, 5s, and 6s:
        :        C-C
        :       /   \
        : Br - C     C - Br
        :       \   /
        :        C-C

 3. In fact, any benzene ligand has important 5s and 6s going around
    the ring.  There are various Abs-C-C 3s, 4s, 5s, and 6s.
        :         C-C
        :        /   \
        : Abs - C     C 
        :        \   /
        :         C-C

 4. Metals out to 8 Angstroms require 5s and 6s



* Ifeffit

In file ~src/lib/iff_show.f~, change line 431 from 

:     character*(*) s, t , messg*256

to

:     character*(*) s, t , messg*1024

+Also need to specify locations of CL data and phase shift tables via an ENV variable+

* Weird stuff I'd prefer not to implement unless demanded
 1. xfit output (only used by women who glow and men who plunder)
 2. csv and text report (excel *is* implemented)
 3. point finder (this was Shelly's request)
 4. session defaults (did anyone but me actually use these?)
 5. set to standard (i.e. the one that is marked) -- confusing and
    little used
 6. tie relative energy value to changes in E0 (this was something
    Jeremy requested originally)
 7. +set e0 by algorithm for all and marked -- also confusing and little used+ (implemented)
 8. +plot margin lines for deglitching, deglitch many points (this was something that was most useful for a timing problem at 10ID that no longer exists)+
    (implemented)
 9. preprocessing truncation and deglitching (truncation might be
    worth implementing)

