todo.html
<li id="sec-4-8-1-2-2">MDS &amp; Fit Sequence [0/4]<br/>
<ul>
<li><code>[&nbsp;]</code> Import mutiple data sets from an Athena project file
</li>
<li><code>[&nbsp;]</code> feffit.inp import: needs testing; MDS that is not merely MKW
</li>
<li><code>[&nbsp;]</code> Clone data sets such that the path list gets replicated efficiently (i.e. for MDS fits)
</li>
<li><code>[&nbsp;]</code> Clone all/marked paths between data sets
</li>
</ul>



</li>
</ul>
</li>
</ul>
</li>
</ul>
<ul>
<li id="sec-4-8-2">Histograms [12/14] [85%]<br/>
<ul>
<li><code>[X]</code> Triangle object
<ul>
<li>yields a DS path and a TS path
</li>
<li>by R and theta
</li>
<li><del>by a trio of Cartesian coordinates</del>
</li>
</ul>

</li>
<li><code>[&nbsp;]</code> triangle histogram
</li>
<li><code>[-]</code> <b>Error checking</b> in Artemis, e.g. check that there is at least one bin in the supplied range(s)
<ul>
<li><code>[X]</code> SS
</li>
<li><code>[&nbsp;]</code> ncl
</li>
<li><code>[&nbsp;]</code> thru
</li>
</ul>

</li>
</ul>


</li>
</ul>
</div>

</div>

<div id="outline-container-4-9" class="outline-3">
<h3 id="sec-4-9"><span class="section-number-3">4.9</span> Hephaestus</h3>
<div class="outline-text-3" id="text-4-9">

<p>  More standards!!
</p>
</div>

</div>

<div id="outline-container-4-10" class="outline-3">
<h3 id="sec-4-10"><span class="section-number-3">4.10</span> Other object types [0/3]</h3>
<div class="outline-text-3" id="text-4-10">

<ul>
<li><code>[&nbsp;]</code> Structural Units
<ul>
<li>Extension of VPath
</li>
<li>Store GDS, feff, and path objects in a zip file.
</li>
<li>On import, mark GDS parameters as merge if in conflict
</li>
</ul>

</li>
<li><code>[&nbsp;]</code> MSPaths
<ul>
<li>Much like SSPath, make an arbitrary n-legged path
</li>
</ul>

</li>
<li><code>[&nbsp;]</code> Nearly collinear paths, ThreeBody
<ul>
<li>Extension of VPath
</li>
<li>need to worry about load order in Demeter.pm
</li>
<li>Define a three body configuration, generate its 4-legged path and a sequence of three-legged paths along with a mixing parameter.
</li>
<li>It will take a single set of path parameters that are pushed onto the generated Path objects, except for the amplitude, which will be computed from the mixing parameter.
</li>
<li>This is a single object for the user to interact with which expands into 2 or 3 3-legged paths and a single 4-legged path
</li>
</ul>

</li>
</ul>



</div>
</div>

</div>

<div id="outline-container-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> Atoms and Feff</h2>
<div class="outline-text-2" id="text-5">




</div>

<div id="outline-container-5-1" class="outline-3">
<h3 id="sec-5-1"><span class="section-number-3">5.1</span> CIF [0/3] [0%]</h3>
<div class="outline-text-3" id="text-5-1">

<ul>
<li><code>[&nbsp;]</code> CIF issue: CIF file with "<sub>eof</sub>" token at end of file, as in <a href="notes/H16PW12O46.cif">this cif file</a>
</li>
<li><code>[&nbsp;]</code> Handle CIF import problems more gracefully (See Shelly's other email from 17 June 2011)
</li>
<li><code>[&nbsp;]</code> CIF errors are not handled gracefully (e.g. multiple occupancy)
</li>
</ul>


</div>

</div>

<div id="outline-container-5-2" class="outline-3">
<h3 id="sec-5-2"><span class="section-number-3">5.2</span> Atoms [3/9] [33%]</h3>
<div class="outline-text-3" id="text-5-2">

<ul>
<li><code>[&nbsp;]</code> Setting of Ba2Co9O14 (Chanapa Kongmark), also some problem with ZnFe2O4
</li>
<li><code>[&nbsp;]</code> Lepidocrocite issue (amam gets changed to cmcm)
</li>
<li><code>[&nbsp;]</code> 2 sites at the same position with occupancies &lt;1.  see file above for an example
</li>
<li><code>[&nbsp;]</code> George Sterbinsky's recent mailing list post that turned out to be about 
        atoms' sphere and rhomboid in a non-orthogonal group
</li>
<li><code>[&nbsp;]</code> very confusing error message when core is not a tag
</li>
<li><code>[&nbsp;]</code> Why does Amam in lepidocrocite get changed to Cmcm ?
</li>
<li><code>[X]</code> Shell tags in the feff.inp ATOMS list
</li>
<li><code>[X]</code> Rhombic groups seem not be handled properly.  This example fails to generate a subshell of 3 atoms at ~1.9A
<pre class="example">
title name:     Fe2O3  hematite
space  R -3 c
a    = 5.0380        b    = 5.0380   c    = 13.7720
rmax = 6.00  core = Fe1
atom
  Fe     0.00000   0.00000   0.35530  Fe1
  O      0.30590   0.00000   0.25000  O1
</pre>

</li>
<li><code>[X]</code> This input data fails
<pre class="example">
title formula:  LaCoO3
title refer1:  PRB V. 66 P. 094408 (2002)
title notes:   T = 300 K
space  r -3 c
a = 5.44864       c = 13.1035
rmax = 6.00       core = Co1
atom
  Co     0.00000   0.00000   0.00000  Co1
  La     0.00000   0.00000   0.25000  La1
  O      0.55032   0.00000   0.25000  O1
</pre>

</li>
</ul>



</div>

</div>

<div id="outline-container-5-3" class="outline-3">
<h3 id="sec-5-3"><span class="section-number-3">5.3</span> Feff</h3>
<div class="outline-text-3" id="text-5-3">


<ul>
<li id="sec-5-3-1">Feff8 is unsupported except as an Atoms output type<br/>

<p>
<a href="https://github.com/xraypy/feff85exafs">https://github.com/xraypy/feff85exafs</a>
</p>
</li>
</ul>
<ul>
<li id="sec-5-3-2">Polarization and ellipticity<br/>

</li>
</ul>
<ul>
<li id="sec-5-3-3">Five and six legged paths<br/>
<ol>
<li><a href="examples/h12213.cif">This CIF file</a> is an example of a structure that has five and six
    legged nearly collinear scattering paths at around 4 Angstroms.  It
    has metal atoms bridged by cyanide (CN), like Prussian Blue (see for
    instance <a href="http://dx.doi.org/10.1021/ic50177a008">http://dx.doi.org/10.1021/ic50177a008</a>)

</li>
<li>Another example: 1-4 dibromo benzene has Br scatterers across a
    benzene ring which can be seen at about 6 Angstroms, along with
    3s, 4s, 5s, and 6s:
<pre class="example">
       C-C
      /   \
Br - C     C - Br
      \   /
       C-C
</pre>


</li>
<li>In fact, any benzene ligand has important 5s and 6s going around
    the ring.  There are various Abs-C-C 3s, 4s, 5s, and 6s.
<pre class="example">
        C-C
       /   \
Abs - C     C 
       \   /
        C-C
</pre>


</li>
<li>Metals out to 8 Angstroms require 5s and 6s
</li>
</ol>




</li>
</ul>
</div>
</div>

</div>

<div id="outline-container-6" class="outline-2">
<h2 id="sec-6"><span class="section-number-2">6</span> Ifeffit</h2>
<div class="outline-text-2" id="text-6">


<p>
In file <code>src/lib/iff_show.f</code>, change line 431 from 
</p>
<pre class="example">
    character*(*) s, t , messg*256
</pre>


<p>
to
</p>
<pre class="example">
    character*(*) s, t , messg*1024
</pre>


<p>
<del>Also need to specify locations of CL data and phase shift tables via an ENV variable</del>
</p>
</div>

</div>

<div id="outline-container-7" class="outline-2">
<h2 id="sec-7"><span class="section-number-2">7</span> Weird stuff I'd prefer not to implement unless demanded</h2>
<div class="outline-text-2" id="text-7">

<ol>
<li>xfit output (only used by women who glow and men who plunder)
</li>
<li>csv and text report (excel <b>is</b> implemented)
</li>
<li>point finder (this was Shelly's request)
</li>
<li>session defaults (did anyone but me actually use these?)
</li>
<li>set to standard (i.e. the one that is marked) &ndash; confusing and
    little used
</li>
<li>tie relative energy value to changes in E0 (this was something
    Jeremy requested originally)
</li>
<li><del>set e0 by algorithm for all and marked &ndash; also confusing and little used</del> (implemented)
</li>
<li><del>plot margin lines for deglitching, deglitch many points (this was something that was most useful for a timing problem at 10ID that no longer exists)</del>
    (implemented)
</li>
<li>preprocessing truncation and deglitching (truncation might be
    worth implementing)
</li>
</ol>


</div>
</div>
</div>

<div id="postamble">
<p class="date">Date: 2014-01-24T16:07-0500</p>
<p class="author">Author: Bruce Ravel</p>
<p class="creator"><a href="http://orgmode.org">Org</a> version 7.9.2 with <a href="http://www.gnu.org/software/emacs/">Emacs</a> version 24</p>
<a href="http://validator.w3.org/check?uri=referer">Validate XHTML 1.0</a>

</div>
</body>
</html>
